{
  "titleObject": "Minhas Experiências Profissionais",
  "data": [
    {
      "title": "Modernização de Site de Consulta Médica",
      "data": "Outubro 2024 - Dezembro 2024",
      "description": "Reformulação do site de consulta médica utilizando Angular.",
      "details": "Atuei na reestruturação e modernização do site de consulta médica na Galáxia Digital, migrando de JavaScript puro para Angular. A transformação incluiu melhorias na interface, usabilidade e desempenho, resultando em um design mais moderno e funcional."
    },
    {
      "title": "Desenvolvimento de Site para Empresa de Colchões",
      "data": "Outubro 2024 - Dezembro 2024",
      "description": "Desenvolvimento de site para uma empresa de colchões com Angular.",
      "details": "Fui responsável por criar e otimizar o site de uma empresa de colchões, usando Angular para substituir o código em JavaScript puro. O projeto resultou em um design mais sofisticado, com uma experiência do usuário aprimorada, navegabilidade mais rápida e um visual mais atual."
    },
    {
      "title": "Redução de Filas e Aumento de Vendas",
      "data": "Junho 2023 - Abril 2024",
      "description": "Implementação de melhorias no sistema de pagamento.",
      "details": "Atuei na otimização do fluxo de pagamentos no Grupo Panvel, permitindo que fossem realizados diretamente no balcão. Essa mudança reduziu drasticamente as filas e impactou positivamente as vendas."
    },
    {
      "title": "Correção de Bugs e Garantia de Qualidade",
      "data": "Junho 2023 - Abril 2024",
      "description": "Identificação e correção de falhas antes da entrega.",
      "details": "Realizei testes contínuos e antecipação de problemas no Grupo Panvel, garantindo a entrega de um código mais estável e seguro, minimizando falhas em produção."
    },
    {
      "title": "Melhoria na Experiência do Usuário",
      "data": "Junho 2023 - Abril 2024",
      "description": "Otimização de interfaces para novos sistemas.",
      "details": "No Grupo Panvel, trabalhei na otimização de interfaces para tornar os novos fluxos do sistema mais intuitivos e eficientes. Aprimorei o processo de pagamento e adaptei a interface para facilitar a adoção por usuários, garantindo uma experiência mais fluida e acessível."
    },
    {
      "title": "Code Review e Qualidade de Código",
      "data": "Junho 2023 - Abril 2024",
      "description": "Revisão de código para garantir confiabilidade e performance.",
      "details": "Durante minha atuação no Grupo Panvel, participei ativamente das revisões de código, identificando problemas críticos e sugerindo melhorias. Essas práticas ajudaram a manter um código mais limpo, padronizado e com melhor performance, garantindo entregas mais seguras e eficientes."
    },
    {
      "title": "Desenvolvimento de Plataforma Interna para Startups",
      "data": "Julho 2021 - Junho 2023",
      "description": "Criação de sistema interno para gestão de startups.",
      "details": "Fui responsável pelo desenvolvimento de uma plataforma interna para startups no Grupo Panvel, eliminando a dependência de softwares de terceiros. O projeto trouxe mais autonomia e controle sobre os processos, permitindo uma gestão mais eficiente e personalizada."
    },
    {
      "title": "Exploração de IA para Processamento de Documentos",
      "data": "Julho 2021 - Junho 2023",
      "description": "Conversão automatizada de PDFs em strings estruturadas.",
      "details": "No Grupo Panvel, explorei o uso de Inteligência Artificial para automatizar o processamento de documentos. Desenvolvi um sistema capaz de extrair e estruturar dados de PDFs, otimizando processos internos e reduzindo a necessidade de intervenção manual."
    },
    {
      "title": "Desenvolvimento Front-end no Site da Panvel",
      "data": "Julho 2021 - Junho 2023",
      "description": "Atuação na interface do site com Angular e NgRx.",
      "details": "Atuei no desenvolvimento do site da Panvel utilizando Angular, NgRx e RxJS, garantindo uma interface dinâmica e responsiva. Além disso, implementei testes automatizados com Cypress e Jasmine, assegurando a qualidade e estabilidade das funcionalidades entregues."
    },
    {
      "title": "Gestão de Loja e Suporte Multifuncional",
      "data": "Setembro 2015 - Novembro 2019",
      "description": "Gerenciamento de loja e suporte operacional.",
      "details": "No Clica Combustível, fui responsável pela gestão da loja de conveniência, garantindo a organização e o bom funcionamento do estabelecimento. Além disso, atuei de forma multifuncional, auxiliando como caixa e frentista quando necessário."
    },
    {
      "title": "Gestão de TI e Suporte Técnico",
      "data": "Setembro 2015 - Novembro 2019",
      "description": "Manutenção e suporte de infraestrutura de TI.",
      "details": "Atuei no Clica Combustível como responsável pela manutenção da infraestrutura de TI, realizando diagnósticos e reparos em computadores. Também gerenciei a rede e os sistemas internos, garantindo a operação contínua e eficiente da loja."
    },
    {
      "title": "Monitoramento de Câmeras e CFTV",
      "data": "Setembro 2015 - Novembro 2019",
      "description": "Supervisão de segurança por videomonitoramento.",
      "details": "Fui responsável pela gestão do sistema de câmeras de segurança no Clica Combustível, garantindo a integridade das operações e contribuindo ativamente para a prevenção de incidentes."
    }
  ]
}
