{
  "titleObject": "Mis experiencias profesionales",
  "data": [
    {
      "title": "Modernización del sitio web de consulta médica",
      "data": "Octubre 2024 - Diciembre 2024",
      "description": "Reformulación del sitio web de consulta médica utilizando Angular.",
      "details": "Trabajé en la reestructuración y modernización del sitio web de consulta médica en Galaxia Digital, migrando de JavaScript puro a Angular. La transformación incluyó mejoras en la interfaz, usabilidad y rendimiento, logrando un diseño más moderno y funcional."
    },
    {
      "title": "Desarrollo de sitio web para empresa de colchones",
      "data": "Octubre 2024 - Diciembre 2024",
      "description": "Desarrollo de un sitio web para una empresa de colchones con Angular.",
      "details": "Fui responsable de crear y optimizar el sitio web de una empresa de colchones, utilizando Angular para reemplazar el código en JavaScript puro. El proyecto resultó en un diseño más sofisticado, con una mejor experiencia de usuario, navegación más rápida y una apariencia más moderna."
    },
    {
      "title": "Reducción de filas y aumento de ventas",
      "data": "Junio 2023 - Abril 2024",
      "description": "Implementación de mejoras en el sistema de pago.",
      "details": "Trabajé en la optimización del flujo de pagos en Grupo Panvel, permitiendo que los pagos se realizaran directamente en el mostrador. Este cambio redujo drásticamente las filas e impactó positivamente en las ventas."
    },
    {
      "title": "Corrección de errores y garantía de calidad",
      "data": "Junio 2023 - Abril 2024",
      "description": "Identificación y corrección de fallos antes de la entrega.",
      "details": "Realicé pruebas continuas y anticipación de problemas en Grupo Panvel, asegurando la entrega de un código más estable y seguro, minimizando fallos en producción."
    },
    {
      "title": "Mejora en la experiencia del usuario",
      "data": "Junio 2023 - Abril 2024",
      "description": "Optimización de interfaces para nuevos sistemas.",
      "details": "En Grupo Panvel, trabajé en la optimización de interfaces para hacer que los nuevos flujos del sistema fueran más intuitivos y eficientes. Mejoré el proceso de pago y adapté la interfaz para facilitar la adopción por parte de los usuarios, garantizando una experiencia más fluida y accesible."
    },
    {
      "title": "Revisión de código y calidad del código",
      "data": "Junio 2023 - Abril 2024",
      "description": "Revisión de código para garantizar confiabilidad y rendimiento.",
      "details": "Durante mi trabajo en Grupo Panvel, participé activamente en revisiones de código, identificando problemas críticos y sugiriendo mejoras. Estas prácticas ayudaron a mantener un código más limpio, estandarizado y con mejor rendimiento, asegurando entregas más seguras y eficientes."
    },
    {
      "title": "Desarrollo de plataforma interna para startups",
      "data": "Julio 2021 - Junio 2023",
      "description": "Creación de un sistema interno para la gestión de startups.",
      "details": "Fui responsable del desarrollo de una plataforma interna para startups en Grupo Panvel, eliminando la dependencia de software de terceros. El proyecto brindó más autonomía y control sobre los procesos, permitiendo una gestión más eficiente y personalizada."
    },
    {
      "title": "Exploración de IA para el procesamiento de documentos",
      "data": "Julio 2021 - Junio 2023",
      "description": "Conversión automatizada de PDFs en cadenas estructuradas.",
      "details": "En Grupo Panvel, exploré el uso de inteligencia artificial para automatizar el procesamiento de documentos. Desarrollé un sistema capaz de extraer y estructurar datos de PDFs, optimizando procesos internos y reduciendo la necesidad de intervención manual."
    },
    {
      "title": "Desarrollo Front-end en el sitio web de Panvel",
      "data": "Julio 2021 - Junio 2023",
      "description": "Trabajo en la interfaz del sitio web con Angular y NgRx.",
      "details": "Trabajé en el desarrollo del sitio web de Panvel utilizando Angular, NgRx y RxJS, garantizando una interfaz dinámica y responsiva. Además, implementé pruebas automatizadas con Cypress y Jasmine, asegurando la calidad y estabilidad de las funcionalidades entregadas."
    },
    {
      "title": "Gestión de tienda y soporte multifuncional",
      "data": "Septiembre 2015 - Noviembre 2019",
      "description": "Gestión de tienda y soporte operativo.",
      "details": "En Clica Combustível, fui responsable de la gestión de la tienda de conveniencia, asegurando la organización y el buen funcionamiento del establecimiento. Además, trabajé de manera multifuncional, ayudando como cajero y empleado de gasolinera cuando fue necesario."
    },
    {
      "title": "Gestión de TI y soporte técnico",
      "data": "Septiembre 2015 - Noviembre 2019",
      "description": "Mantenimiento y soporte de infraestructura de TI.",
      "details": "Trabajé en Clica Combustível como responsable del mantenimiento de la infraestructura de TI, realizando diagnósticos y reparaciones en computadoras. También gestioné la red y los sistemas internos, asegurando el funcionamiento continuo y eficiente de la tienda."
    },
    {
      "title": "Monitoreo de cámaras y CCTV",
      "data": "Septiembre 2015 - Noviembre 2019",
      "description": "Supervisión de seguridad por videovigilancia.",
      "details": "Fui responsable de la gestión del sistema de cámaras de seguridad en Clica Combustível, asegurando la integridad de las operaciones y contribuyendo activamente a la prevención de incidentes."
    }
  ]
}

