{
  "titleObject": "My Professional Experiences",
  "data": [
    {
      "title": "Medical Consultation Website Modernization",
      "data": "October 2024 - December 2024",
      "description": "Redesign of a medical consultation website using Angular.",
      "details": "I worked on the restructuring and modernization of a medical consultation website at Galáxia Digital, migrating from plain JavaScript to Angular. The transformation included improvements in interface, usability, and performance, resulting in a more modern and functional design."
    },
    {
      "title": "Website Development for a Mattress Company",
      "data": "October 2024 - December 2024",
      "description": "Development of a website for a mattress company using Angular.",
      "details": "I was responsible for creating and optimizing the website for a mattress company, using Angular to replace the existing plain JavaScript code. The project resulted in a more sophisticated design, an enhanced user experience, faster navigation, and a more modern look."
    },
    {
      "title": "Queue Reduction and Sales Increase",
      "data": "June 2023 - April 2024",
      "description": "Implementation of improvements in the payment system.",
      "details": "I worked on optimizing the payment process at Grupo Panvel, allowing transactions to be completed directly at the counter. This change drastically reduced queues and positively impacted sales."
    },
    {
      "title": "Bug Fixing and Quality Assurance",
      "data": "June 2023 - April 2024",
      "description": "Identifying and fixing issues before release.",
      "details": "I conducted continuous testing and early problem detection at Grupo Panvel, ensuring the delivery of more stable and secure code, minimizing production failures."
    },
    {
      "title": "User Experience Improvement",
      "data": "June 2023 - April 2024",
      "description": "Interface optimization for new systems.",
      "details": "At Grupo Panvel, I worked on interface optimization to make new system workflows more intuitive and efficient. I improved the payment process and adapted the interface to facilitate user adoption, ensuring a smoother and more accessible experience."
    },
    {
      "title": "Code Review and Code Quality",
      "data": "June 2023 - April 2024",
      "description": "Code review to ensure reliability and performance.",
      "details": "During my time at Grupo Panvel, I actively participated in code reviews, identifying critical issues and suggesting improvements. These practices helped maintain cleaner, standardized, and higher-performing code, ensuring safer and more efficient deliveries."
    },
    {
      "title": "Development of an Internal Platform for Startups",
      "data": "July 2021 - June 2023",
      "description": "Creation of an internal system for startup management.",
      "details": "I was responsible for developing an internal platform for startups at Grupo Panvel, eliminating reliance on third-party software. The project brought more autonomy and control over processes, allowing for more efficient and personalized management."
    },
    {
      "title": "AI Exploration for Document Processing",
      "data": "July 2021 - June 2023",
      "description": "Automated conversion of PDFs into structured strings.",
      "details": "At Grupo Panvel, I explored the use of Artificial Intelligence to automate document processing. I developed a system capable of extracting and structuring data from PDFs, optimizing internal processes and reducing the need for manual intervention."
    },
    {
      "title": "Front-End Development for Panvel's Website",
      "data": "July 2021 - June 2023",
      "description": "Worked on the website interface using Angular and NgRx.",
      "details": "I worked on the development of Panvel's website using Angular, NgRx, and RxJS, ensuring a dynamic and responsive interface. Additionally, I implemented automated tests with Cypress and Jasmine, guaranteeing quality and stability of delivered functionalities."
    },
    {
      "title": "Store Management and Multifunctional Support",
      "data": "September 2015 - November 2019",
      "description": "Store management and operational support.",
      "details": "At Clica Combustível, I was responsible for managing the convenience store, ensuring organization and smooth operation. Additionally, I took on multifunctional roles, assisting as a cashier and gas station attendant when needed."
    },
    {
      "title": "IT Management and Technical Support",
      "data": "September 2015 - November 2019",
      "description": "IT infrastructure maintenance and support.",
      "details": "At Clica Combustível, I was responsible for maintaining the IT infrastructure, diagnosing and repairing computers. I also managed the network and internal systems, ensuring the continuous and efficient operation of the store."
    },
    {
      "title": "Camera and CCTV Monitoring",
      "data": "September 2015 - November 2019",
      "description": "Security monitoring through video surveillance.",
      "details": "I was responsible for managing the security camera system at Clica Combustível, ensuring operational integrity and actively contributing to incident prevention."
    }
  ]
}
