{
  "titleObject": "Mis Experiencias Profesionales",
  "data": [
    {
      "title": "Modernización del Sitio de Consulta Médica",
      "data": "Octubre 2024 - Diciembre 2024",
      "description": "Reformulación del sitio de consulta médica utilizando Angular.",
      "details": "Trabajé en la reestructuración y modernización del sitio de consulta médica en Galáxia Digital, migrando de JavaScript puro a Angular. La transformación incluyó mejoras en la interfaz, usabilidad y rendimiento, resultando en un diseño más moderno y funcional."
    },
    {
      "title": "Desarrollo del Sitio para Empresa de Colchones",
      "data": "Octubre 2024 - Diciembre 2024",
      "description": "Desarrollo de sitio web para una empresa de colchones con Angular.",
      "details": "Fui responsable de crear y optimizar el sitio web de una empresa de colchones, utilizando Angular para reemplazar el código en JavaScript puro. El proyecto resultó en un diseño más sofisticado, con una experiencia de usuario mejorada, navegación más rápida y un aspecto más actualizado."
    },
    {
      "title": "Reducción de Filas y Aumento de Ventas",
      "data": "Junio 2023 - Abril 2024",
      "description": "Implementación de mejoras en el sistema de pago.",
      "details": "Trabajé en la optimización del flujo de pagos en Grupo Panvel, permitiendo que se realizaran directamente en el mostrador. Este cambio redujo drásticamente las filas e impactó positivamente las ventas."
    },
    {
      "title": "Corrección de Errores y Garantía de Calidad",
      "data": "Junio 2023 - Abril 2024",
      "description": "Identificación y corrección de fallas antes de la entrega.",
      "details": "Realicé pruebas continuas y anticipación de problemas en Grupo Panvel, garantizando la entrega de un código más estable y seguro, minimizando fallas en producción."
    },
    {
      "title": "Mejora en la Experiencia del Usuario",
      "data": "Junio 2023 - Abril 2024",
      "description": "Optimización de interfaces para nuevos sistemas.",
      "details": "En Grupo Panvel, trabajé en la optimización de interfaces para hacer que los nuevos flujos del sistema fueran más intuitivos y eficientes. Mejoré el proceso de pago y adapté la interfaz para facilitar la adopción por parte de los usuarios, asegurando una experiencia más fluida y accesible."
    }
  ]
}
