{
  "titleObject": "My Professional Experiences",
  "data": [
    {
      "title": "Medical Consultation Website Modernization",
      "data": "October 2024 - December 2024",
      "description": "Redesign of the medical consultation website using Angular.",
      "details": "I worked on the restructuring and modernization of the medical consultation website at Galáxia Digital, migrating from pure JavaScript to Angular. The transformation included improvements in interface, usability, and performance, resulting in a more modern and functional design."
    },
    {
      "title": "Website Development for Mattress Company",
      "data": "October 2024 - December 2024",
      "description": "Development of a website for a mattress company using Angular.",
      "details": "I was responsible for creating and optimizing the website for a mattress company using Angular to replace the pure JavaScript code. The project resulted in a more sophisticated design, improved user experience, faster navigation, and a more modern look."
    },
    {
      "title": "Queue Reduction and Sales Increase",
      "data": "June 2023 - April 2024",
      "description": "Implementation of improvements in the payment system.",
      "details": "I worked on optimizing the payment flow at Grupo Panvel, enabling transactions directly at the counter. This change drastically reduced queues and positively impacted sales."
    },
    {
      "title": "Bug Fixing and Quality Assurance",
      "data": "June 2023 - April 2024",
      "description": "Identification and fixing of issues before delivery.",
      "details": "I performed continuous testing and problem anticipation at Grupo Panvel, ensuring the delivery of a more stable and secure code, minimizing failures in production."
    },
    {
      "title": "User Experience Improvement",
      "data": "June 2023 - April 2024",
      "description": "Interface optimization for new systems.",
      "details": "At Grupo Panvel, I worked on optimizing interfaces to make new system workflows more intuitive and efficient. I improved the payment process and adapted the interface to ease adoption by users, ensuring a smoother and more accessible experience."
    }
  ]
}
